case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inletXMinus
    {
        type            wall;
        inGroups        1(wall);
        nFaces          48;
        startFace       69304;
    }
    inletXPlus
    {
        type            wall;
        inGroups        1(wall);
        nFaces          48;
        startFace       69352;
    }
    inletYMinus
    {
        type            wall;
        inGroups        1(wall);
        nFaces          48;
        startFace       69400;
    }
    inletYPlus
    {
        type            wall;
        inGroups        1(wall);
        nFaces          48;
        startFace       69448;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          132;
        startFace       69496;
    }
    valve
    {
        type            wall;
        inGroups        1(wall);
        nFaces          280;
        startFace       69628;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6180;
        startFace       69908;
    }
)

// ************************************************************************* //
