case/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
69304
(
0.00211095
0.000778103
0.00211095
-0.00179426
0.00159085
0.000655146
0.00204827
-0.00153309
...
)
;

boundaryField
{
    inletXMinus
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
-0.0025
-0.0025
-0.0025
-0.0025
-0.0025
-0.0025
-0.0025
-0.0025
...
)
;
    }
    inletXPlus
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
-0.0025
-0.0025
-0.0025
-0.0025
-0.0025
-0.0025
-0.0025
-0.0025
...
)
;
    }
    inletYMinus
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
-0.0025
-0.0025
-0.0025
-0.0025
-0.0025
-0.0025
-0.0025
-0.0025
...
)
;
    }
    inletYPlus
    {
        type            calculated;
        value           nonuniform List<scalar> 
48
(
-0.0025
-0.0025
-0.0025
-0.0025
-0.0025
-0.0025
-0.0025
-0.0025
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
132
(
0.000416278
0.000416278
0.000416278
0.000416278
0.000416278
0.000416278
0.000416278
0.000416278
...
)
;
    }
    valve
    {
        type            calculated;
        value           uniform 0;
    }
    walls
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
